[
{
	"LANGUAGE": "en",
	"TITLE": "Insecure random generator",
	"OBSERVATION": 
	{
		"TITLE": "A predictable random number generation function is in use.",
		"NOTE": ""
	},
	"IMPLICATION": "A malicious individual may be able to guess numbers generated with this function in order to perform a related attack.",
	"RECOMMENDATION": 
	{
		"TITLE": "Management should consider using a common known random number generator which is compliant to security standards.",
		"URLS": ["https://www.owasp.org/index.php/Guide_to_Cryptography"]
	},
	"SEVERITY": "Low"
},
{
	"LANGUAGE": "en",
	"TITLE": "Inadequeate error handler",
	"OBSERVATION": 
	{
		"TITLE": "Error conditions on the affected resources produce error messages which may disclose information about applications, server infrastructure or technologies used by the application",
		"NOTE": ""
	},
	"IMPLICATION": "Information gathering is usually the first step to an attack. If the presented errors disclose information about the applications and/or the server infrastructure, a malicious individual may be able to leverage it in order to generate more accurate and complex attacks.",
	"RECOMMENDATION": 
	{
		"TITLE": "Management should consider modifying the application server configuration to implement a customized error page with a generic message that does not reveal information related to the supporting infrastructure or application.",
		"URLS": ["http://cwe.mitre.org/data/definitions/209.html", "http://cwe.mitre.org/data/definitions/756.html"]
	},
	"SEVERITY": "Low"
},
{
	"LANGUAGE": "en",
	"TITLE": "Potentially sensitive information in localstorage",
	"OBSERVATION": 
	{
		"TITLE": "The affected resources disclose potentially sensitive information such as session tokens.",
		"NOTE": ""
	},
	"IMPLICATION": "",
	"RECOMMENDATION": 
	{
		"TITLE": "Management should consider analyzing if it is possible to remove or obfuscate the currently disclosed information. Furthermore, management should consider use session storage instead of local storage for store session tokens. Finally, management should consider performing an exhaustive review of the application, searching for information disclosure.",
		"URLS": ["http://cwe.mitre.org/data/definitions/200.html"]
	},
	"SEVERITY": "Medium"
},
{
	"LANGUAGE": "en",
	"TITLE": "A hardcoded username in plain text is identified. Store it properly in an environment variable",
	"OBSERVATION": 
	{
		"TITLE": "A hardcoded username in plain text is identified in the affected resources.",
		"NOTE": ""
	},
	"IMPLICATION": "Files containing credentials in plain text are a primary target once a malicious user has access to a system. Any malicious user with access to the affected files will be able to obtain the hard coded credentials which provides an opportunity to obtain and access to sensitive information.",
	"RECOMMENDATION": 
	{
		"TITLE": "The hardcoded credentials for the configuration files should be protected using the platform capabilities to manage passwords in a more secure way. In particular, management should evaluate the use of vault to store all credentials and API keys",
		"URLS": ["https://cwe.mitre.org/data/definitions/798.html", "http://cwe.mitre.org/data/definitions/321.html"]
	},
	"SEVERITY": "Medium"
}