{
	"LANGUAGE": "spa",
	"TITLE": "Inadecuada configuración de encabezados de seguridad",
	"OBSERVATION": {
		"TITLE": "Se ha observado que la aplicación presenta debilidades en la configuración de encabezados de seguridad. En particular los siguientes encabezados se han identificado como faltantes o incorrectamente configurados:<X-XSS-Protection,CSP,X-Content-Type-Options,HTTP Strict-Transport-Security,X-Frame-Options>\nEl encabezado X-XSS-Protection previene al navegador del usuario de la ejecución del contenido JavaScript inyectado que se vea reflejado en las respuestas de la aplicación.\nEl encabezado Content-Security-Policy previene al navegador de cargar recursos provenientes de otros sitios, como ser JavaScript.\nEl encabezado HTTP Strict-Transport-Security se utiliza para informar a los navegadores que las aplicaciones web sólo se deben acceder a través de HTTPS, lo que impide el uso de canales sin cifrar.\nEl encabezado X-Frame-Options se utiliza para prevenir ataques conocidos como clickjacking donde la aplicación web afectada es cargada a través de objetos del tipo frame / iframe sobre un sitio malicioso.\nAdemás, si el encabezado X-Content-Type-Options no está presente, la aplicación no podrá prevenir que el navegador trate de inferir el tipo de contenido de la respuesta a partir del análisis de dicho contenido. Esto permitiría a un individuo malicioso que tuviera la posibilidad de subir contenido al servidor, a subir un archivo malicioso (por ejemplo, con código JavaScript) utilizando una extensión considerada inofensiva (.jpg). Al no estar configurado el encabezado de seguridad en cuestión, un usuario podría acceder al archivo malicioso, sin advertir que el navegador podría inferir el tipo de contenido como “text/javascript” y ejecutar el código malicioso.",
		"NOTE": "La falta o configuración incorrecta de estos encabezados no representa la existencia efectiva de la vulnerabilidad asociada sobre cada uno, o una posibilidad concreta de explotación."
	},
	"IMPLICATION": "La falta de una protección anti-clickjacking podría forzar al navegador del usuario a cargar un sitio web incluido dentro de las etiquetas <frame> o <iframe>. Esto podría proveerle a un individuo malicioso la capacidad de aplicar técnicas de ingeniería social contra usuarios legítimos de la aplicación, induciéndolos a realizar un \"click\" sobre el contenido malicioso, con el fin de intentar obtener sus credenciales u otra información de sesión que le permita obtener acceso no autorizado a la aplicación.\nSi una aplicación web no impide su acceso a través de un canal no cifrado (HTTP), entonces un usuario válido puede ser víctima de un tipo de ataque de tipo hombre en el medio como los basados en SSL Stripping o usando un certificado SSL no válido. Que puede ser utilizado por una persona malintencionada para obtener acceso no autorizado a datos confidenciales o para acceder a la aplicación haciéndose pasar por la víctima.\nLa falta de encabezados CSP y X-XSS-Protection, le podría permitir a un usuario malicioso abusar de otras vulnerabilidades, como XSS, para cargar recursos adicionales como scripts o exploits en los navegadores de las víctimas para aumentar los vectores de ataque que tienen a su disposición.",
	"RECOMMENDATION": {
		"TITLE": "Se recomienda realizar la respectiva configuración de los encabezados mencionados previamente, de forma correcta, para prevenir eventuales ataques por ausencia de los mismos.",
		"URLS": ["https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-XSS-Protection", "https://www.owasp.org/index.php/Content_Security_Policy", "https://docs.microsoft.com/en-us/previous-versions/windows/internet-explorer/ie-developer/compatibility/gg622941(v=vs.85)?redirectedfrom=MSDN"]
	},
	"SEVERITY": "BAJO"
}